Revit 2027 API
Family.IsParametric Property
 Identifies whether the family contains parametric relations between some of its elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsParametric { get; }
Public ReadOnly Property IsParametric As Boolean
	Get
public:
property bool IsParametric {
	bool get ();
}
member IsParametric : bool with get
Property Value
Boolean
Remarks
A family is parametric if it contains parameter-driven relations between its elements, such as labeled dimensions or locked tangential joins.
Parametric families containing large sketches may cause performance problems. Caution is therefore advised before adding any constraints to a yet non-parametric family that already contains large sketches. See HasLargeSketches().
See Also
Reference
Family Class
Autodesk.Revit.DB Namespace